#lang sicp
(define (A x y)
    (cond ((= y 0) 0)
          ((= x 0) (* 2 y))
          ((= y 1) 2)
          (else (A (- x 1) (A x (- y 1))))
    )
)
(display (A 1 10)) ; 1024
(display "-")
(display (A 2 4)) ; 65536
(display "-")
(display (A 3 3)) ; 65536
(display "-")
(display (A 2 3)) ; 16 


#| 
如果x=0，那么（A 0 y）就是 2y

如果x=1 （A 1 3）展开就是
|# 
(A 1 3)
(A 0 (A 1 2))
(A 0 (A 0 (A 0 1)))
(A 0 (A 0 2))
(A 0 4)
8
; 就相当于 y^2, 所以（A 1 10）就是2^10 = 1024

; 如果x=2 那么（A 2 3） 展开就是
(A 2 3)
(A 1 (A 2 2))
(A 1 (A 1 (A 2 1)))
(A 1 (A 1 2)) ; 从上面推论可得（A 1 2）就是2^2=4
(A 1 4) ; 就是2^4
16
;
(A 2 4)
(A 1 (A 2 3))
(A 1 16) ; 2^16
65536

(A 3 1)
2
;
(A 3 2)
(A 2 A(3 1))
(A 2 2)
(A 1 (A 2 1))
(A 1 2)
4
;
(A 3 3)
(A 2 (A 3 2)) ; (A 3 2) = 4
(A 2 4) ; (A 2 4) = 2^16
65536
